!ghdl -i ../../../../src/gen/*.vhd ../../../../src/rtl/*.vhd ../rtl/*.vhd ../cpld/*.vhd && ghdl -m ff_type rtl && ghdl -m ff_type_cpld struct

ghdl --latches ff_type; hierarchy -auto-top; flatten; proc; async2sync; opt -mux_bool -mux_undef; rename -top gold; design -stash gold
ghdl --latches ff_type_cpld; hierarchy -auto-top; flatten; async2sync; opt -mux_bool -mux_undef; rename -top gate; design -stash gate

design -copy-from gold -as gold gold; design -copy-from gate -as gate gate

miter -equiv -flatten -make_assert -make_outputs gold gate miter
sat -verify -tempinduct -prove trigger 0 -set in_i_res 0 -set-at 1 in_i_res 1 -seq 1 miter
