!ghdl -i ../../../../src/gen/*.vhd ../../../../src/rtl/*.vhd ../rtl/*.vhd ../cpld/*.vhd && ghdl -m oe rtl && ghdl -m oe_cpld struct

ghdl oe; hierarchy -auto-top; proc; async2sync; opt; tribuf -formal; rename -top gold; design -stash gold
ghdl --latches oe_cpld; hierarchy -auto-top; flatten; async2sync; opt; tribuf -formal; rename -top gate; design -stash gate

design -copy-from gold -as gold gold; design -copy-from gate -as gate gate

miter -equiv -flatten -make_assert -make_outputs gold gate miter
sat -verify -tempinduct -prove trigger 0 -set in_i_res 0 -set-at 1 in_i_res 1 -seq 1 miter
